{"class_name": "Model", "keras_version": "2.1.6-tf", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 2, 1], "name": "coord_input", "sparse": false}, "inbound_nodes": [], "name": "coord_input"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "coord_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 20, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["coord_input", 0, 0, {}]]], "name": "coord_conv1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "coord_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 10, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["coord_conv1", 0, 0, {}]]], "name": "coord_conv2"}, {"class_name": "MaxPooling1D", "config": {"name": "coord_maxpool1", "dtype": "float32", "trainable": true, "pool_size": [2], "padding": "same", "strides": [2]}, "inbound_nodes": [[["coord_conv2", 0, 0, {}]]], "name": "coord_maxpool1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "coord_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 20, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["coord_maxpool1", 0, 0, {}]]], "name": "coord_conv3"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "coord_conv4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 10, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["coord_conv3", 0, 0, {}]]], "name": "coord_conv4"}, {"class_name": "MaxPooling1D", "config": {"name": "coord_maxpool2", "dtype": "float32", "trainable": true, "pool_size": [2], "padding": "same", "strides": [2]}, "inbound_nodes": [[["coord_conv4", 0, 0, {}]]], "name": "coord_maxpool2"}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "coord_flatten", "data_format": "channels_last"}, "inbound_nodes": [[["coord_maxpool2", 0, 0, {}]]], "name": "coord_flatten"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "coord_dense1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["coord_flatten", 0, 0, {}]]], "name": "coord_dense1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "coord_dense2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["coord_dense1", 0, 0, {}]]], "name": "coord_dense2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "coord_tanh", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["coord_dense2", 0, 0, {}]]], "name": "coord_tanh"}], "input_layers": [["coord_input", 0, 0]], "output_layers": [["coord_tanh", 0, 0]], "name": "model"}, "backend": "tensorflow"}