{"class_name": "Model", "keras_version": "2.1.6-tf", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 20, 200, 10], "name": "lidar_input", "sparse": false}, "inbound_nodes": [], "name": "lidar_input"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 20, 200, 10], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_input", 0, 0, {}]]], "name": "lidar_conv1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_conv1", 0, 0, {}]]], "name": "lidar_conv2"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_conv2", 0, 0, {}]]], "name": "lidar_conv3"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "lidar_add1"}, "inbound_nodes": [[["lidar_conv3", 0, 0, {}], ["lidar_conv1", 0, 0, {}]]], "name": "lidar_add1"}, {"class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["lidar_add1", 0, 0, {}]]], "name": "lidar_maxpool1"}, {"class_name": "Dropout", "config": {"name": "lidar_dropout1", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "inbound_nodes": [[["lidar_maxpool1", 0, 0, {}]]], "name": "lidar_dropout1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_dropout1", 0, 0, {}]]], "name": "lidar_conv4"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_conv4", 0, 0, {}]]], "name": "lidar_conv5"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "lidar_add2"}, "inbound_nodes": [[["lidar_conv5", 0, 0, {}], ["lidar_dropout1", 0, 0, {}]]], "name": "lidar_add2"}, {"class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["lidar_add2", 0, 0, {}]]], "name": "lidar_maxpool2"}, {"class_name": "Dropout", "config": {"name": "lidar_dropout2", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "inbound_nodes": [[["lidar_maxpool2", 0, 0, {}]]], "name": "lidar_dropout2"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_dropout2", 0, 0, {}]]], "name": "lidar_conv6"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_conv6", 0, 0, {}]]], "name": "lidar_conv7"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "lidar_add3"}, "inbound_nodes": [[["lidar_conv7", 0, 0, {}], ["lidar_dropout2", 0, 0, {}]]], "name": "lidar_add3"}, {"class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool3", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2]}, "inbound_nodes": [[["lidar_add3", 0, 0, {}]]], "name": "lidar_maxpool3"}, {"class_name": "Dropout", "config": {"name": "lidar_dropout3", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "inbound_nodes": [[["lidar_maxpool3", 0, 0, {}]]], "name": "lidar_dropout3"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_dropout3", 0, 0, {}]]], "name": "lidar_conv8"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_conv9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["lidar_conv8", 0, 0, {}]]], "name": "lidar_conv9"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "lidar_add4"}, "inbound_nodes": [[["lidar_conv9", 0, 0, {}], ["lidar_dropout3", 0, 0, {}]]], "name": "lidar_add4"}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "lidar_flatten", "data_format": "channels_last"}, "inbound_nodes": [[["lidar_add4", 0, 0, {}]]], "name": "lidar_flatten"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_dense1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 9.999999747378752e-06}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lidar_flatten", 0, 0, {}]]], "name": "lidar_dense1"}, {"class_name": "Dropout", "config": {"name": "lidar_dropout4", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "inbound_nodes": [[["lidar_dense1", 0, 0, {}]]], "name": "lidar_dropout4"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "lidar_dense2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 9.999999747378752e-06}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lidar_dropout4", 0, 0, {}]]], "name": "lidar_dense2"}, {"class_name": "Dropout", "config": {"name": "lidar_dropout5", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "inbound_nodes": [[["lidar_dense2", 0, 0, {}]]], "name": "lidar_dropout5"}], "input_layers": [["lidar_input", 0, 0]], "output_layers": [["lidar_dropout5", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}